app/controllers/locations_controller.rb

  def index
    @locations = Location.all(:limit => 2)
---
SELECT * FROM `locations` LIMIT 0, 30